## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                    |
|--------|-------------------------------------------|
| add    | `aws_glue_trigger.platform_gc_notify_job` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_trigger.platform_gc_notify_job will be created
  + resource "aws_glue_trigger" "platform_gc_notify_job" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "Platform / GC Notify"
      + schedule = "cron(0 5 * * ? *)"
      + state    = (known after apply)
      + tags_all = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + type     = "SCHEDULED"

      + actions {
          + job_name = "Platform / GC Notify"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
